Ran Plan for dir: `terraform/modules/s3bucket` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_api_gateway_rest_api.example2: Refreshing state... [id=zkrz5a92a2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_api_gateway_rest_api.example2 has been changed
~ resource "aws_api_gateway_rest_api" "example2" {
        id                           = "zkrz5a92a2"
        name                         = "example2"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_api_gateway_rest_api.example2 will be destroyed
- resource "aws_api_gateway_rest_api" "example2" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:eu-west-1::/restapis/zkrz5a92a2" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2022-04-04T10:11:53Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:eu-west-1:967071094996:zkrz5a92a2" -> null
      - id                           = "zkrz5a92a2" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "example2" -> null
      - root_resource_id             = "q7vws8t9l9" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "REGIONAL",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # aws_s3_bucket.b will be created
+ resource "aws_s3_bucket" "b" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "my-tf-test-bucket"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                             = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/modules/s3bucket`
* :put_litter_in_its_place: To **delete** this plan click [here](https://43ce-82-37-137-161.ngrok.io/lock?id=ashgbruh%252Fredesigned-dollop%252Fterraform%252Fmodules%252Fs3bucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/modules/s3bucket`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
